// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5

Console.Write("Введите число: ");
string a = Convert.ToString(Console.ReadLine());
int sum = 0;

for (int i = 0; i < a.Length; i++)
{
    if (a[i]== '0' || a[i] == '1' || a[i] == '2' || a[i] == '3' || a[i] == '4' || a[i] == '5' || a[i] == '6' || a[i] == '7' || a[i] == '8' || a[i] == '9')
    {
        sum++;
    }
}
Console.WriteLine(sum);